etp-backend/src/main/resources/asha/execute-operation.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageHeader xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:messageVersion>1.0</ns0:messageVersion>
            <ns0:requestId>{{request-id}}</ns0:requestId>
            <ns0:senderId>{{handler}}</ns0:senderId>
        </ns0:MessageHeader>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:executeOperations xmlns:ns0="http://vismaconsulting.fi/ebs/1.0">
            <ns0:operationRequest>
                {{#identity}}
                <ns0:IdentityChain>
                    {{#case}}
                    <ns0:CaseNumberIdentity>
                        <ns0:caseNumber>{{number}}</ns0:caseNumber>
                    </ns0:CaseNumberIdentity>
                    {{/case}}
                    {{#processing-action}}
                    <ns0:ProcessingActionNameIdentity>
                        <ns0:name>{{name-identity}}</ns0:name>
                    </ns0:ProcessingActionNameIdentity>
                    {{/processing-action}}
                </ns0:IdentityChain>
                {{/identity}}
                {{#info}}
                <ns0:CaseInfoQueryOperation>
                    {{#case}}
                    <ns0:CaseNumberIdentity>
                        <ns0:caseNumber>{{number}}</ns0:caseNumber>
                    </ns0:CaseNumberIdentity>
                    {{/case}}
                </ns0:CaseInfoQueryOperation>
                {{/info}}
                {{#proceed}}
                <ns0:ProceedOperation>
                    <ns0:decision>{{decision}}</ns0:decision>
                </ns0:ProceedOperation>
                {{/proceed}}
                {{#processing-action}}
                <ns0:CreateProcessingActionOperation>
                    <ns0:name>{{name}}</ns0:name>
                    <ns0:receptionDate>{{reception-date}}</ns0:receptionDate>
                    <ns0:contactingDirection>{{contacting-direction}}</ns0:contactingDirection>
                    <ns0:description>{{description}}</ns0:description>
                    {{#contact}}
                    <ns0:Contact>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:address>{{address}}</ns0:address>
                        <ns0:emailAddress>{{email-address}}</ns0:emailAddress>
                        <ns0:phoneNumber>{{phone-number}}</ns0:phoneNumber>
                        <ns0:firstName>{{last-name}}</ns0:firstName>
                        <ns0:lastName>{{last-name}}</ns0:lastName>
                        <ns0:organizationalUnitName>{{organizational-unit-name}}</ns0:organizationalUnitName>
                        <ns0:businessIdentityCode>{{business-identity-code}}</ns0:businessIdentityCode>
                    </ns0:Contact>
                    {{/contanct}}
                </ns0:CreateProcessingActionOperation>
                {{/processing-action}}
                {{#attach}}
                <ns0:AttachOperation>
                    {{#document}}
                    <ns0:Document>                                                                                                               |
                        <ns0:name>{{name}}</ns0:name>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:content>{{content}}</ns0:content>
                    </ns0:Document>
                    {{/document}}
                    {{#contact}}
                    <ns0:Contact>
                        <ns0:type>{{type}}</ns0:type>
                        <ns0:address>{{address}}</ns0:address>
                        <ns0:emailAddress>{{email-address}}</ns0:emailAddress>
                        <ns0:phoneNumber>{{phone-number}}</ns0:phoneNumber>
                        <ns0:firstName>{{last-name}}</ns0:firstName>
                        <ns0:lastName>{{last-name}}</ns0:lastName>
                        <ns0:organizationalUnitName>{{organizational-unit-name}}</ns0:organizationalUnitName>
                        <ns0:businessIdentityCode>{{business-identity-code}}</ns0:businessIdentityCode>
                    </ns0:Contact>
                    {{/contanct}}
                </ns0:AttachOperation>
                {{/attach}}
            </ns0:operationRequest>
        </ns0:executeOperations>
    </soap-env:Body>
</soap-env:Envelope>